integradora2/app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Sonia', 'Klein', '45021133', 'sonia@gmail.com', '$2y$10$Zgiqalt82CixtWq.O1JxGeP23P5w3xKTJ56zGlV0bHfQSNsSUQiT2')
---
        	echo view('front/footer_view');

		}else{
			$formModel->save([
				'nombre'=> $this->request->getVar('nombre'),
				'apellido'=> $this->request->getVar('apellido'),
				'usuario'=> $this->request->getVar('usuario'),
				'email'=> $this->request->getVar('email'),
				'pass'=> password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),


			]);